In [1]:
import pandas as pd

dict1 = {'company':['A','B','C','A','C','D'], 'mngr':['x', 'y', 'z', 'x', 'p', 'q'], 'amt':[100,200,100,150,300,225]}
df = pd.DataFrame(dict1)

In [2]:
df

  company mngr  amt
0       A    x  100
1       B    y  200
2       C    z  100
3       A    x  150
4       C    p  300
5       D    q  225

In [6]:
x = df.groupby('company')
x

In [5]:
df.groupby('company').sum()

         amt
company
A        250
B        200
C        400
D        225

In [7]:
x.max()

        mngr  amt
company
A          x  150
B          y  200
C          z  300
D          q  225

In [8]:
df.groupby('company').describe()

          amt
        count   mean         std    min    25%    50%    75%    max
company
A         2.0  125.0   35.355339  100.0  112.5  125.0  137.5  150.0
B         1.0  200.0         NaN  200.0  200.0  200.0  200.0  200.0
C         2.0  200.0  141.421356  100.0  150.0  200.0  250.0  300.0
D         1.0  225.0         NaN  225.0  225.0  225.0  225.0  225.0

In [9]:
df.groupby('company').describe().T

company             A      B           C      D
amt count    2.000000    1.0    2.000000    1.0
    mean   125.000000  200.0  200.000000  225.0
    std     35.355339    NaN  141.421356    NaN
    min    100.000000  200.0  100.000000  225.0
    25%    112.500000  200.0  150.000000  225.0
    50%    125.000000  200.0  200.000000  225.0
    75%    137.500000  200.0  250.000000  225.0
    max    150.000000  200.0  300.000000  225.0

In [10]:
df.groupby('company').describe().transpose()

company             A      B           C      D
amt count    2.000000    1.0    2.000000    1.0
    mean   125.000000  200.0  200.000000  225.0
    std     35.355339    NaN  141.421356    NaN
    min    100.000000  200.0  100.000000  225.0
    25%    112.500000  200.0  150.000000  225.0
    50%    125.000000  200.0  200.000000  225.0
    75%    137.500000  200.0  250.000000  225.0
    max    150.000000  200.0  300.000000  225.0

#### finding unique values of a column

In [11]:
df

  company mngr  amt
0       A    x  100
1       B    y  200
2       C    z  100
3       A    x  150
4       C    p  300
5       D    q  225

In [13]:
df['company'].unique()

#to get array of unique values

array(['A', 'B', 'C', 'D'], dtype=object)

In [14]:
df['company'].nunique()

#to get count of unique values

4

In [16]:
df['company'].value_counts()

A    2
C    2
B    1
D    1
Name: company, dtype: int64

##### .apply methos to dataframes

In [17]:
def twice(x):
    return 2*x

In [22]:
df.iloc[0:1,:]

  company mngr  amt
0       A    x  100

In [23]:
df['amt'].apply(twice)

0    200
1    400
2    200
3    300
4    600
5    450
Name: amt, dtype: int64

In [24]:
df['company'].apply(len)

0    1
1    1
2    1
3    1
4    1
5    1
Name: company, dtype: int64

In [25]:
df['amt'].apply(lambda x:x*2)

0    200
1    400
2    200
3    300
4    600
5    450
Name: amt, dtype: int64

In [26]:
df['company'].apply(lambda x:x*2)

0    AA
1    BB
2    CC
3    AA
4    CC
5    DD
Name: company, dtype: object

In [27]:
# to get column_names

df.columns

Index(['company', 'mngr', 'amt'], dtype='object')

In [28]:
# to get indexes

df.index

RangeIndex(start=0, stop=6, step=1)

##### sort

In [29]:
df

  company mngr  amt
0       A    x  100
1       B    y  200
2       C    z  100
3       A    x  150
4       C    p  300
5       D    q  225

In [31]:
df.sort_values('amt', ascending=False)

  company mngr  amt
4       C    p  300
5       D    q  225
1       B    y  200
3       A    x  150
0       A    x  100
2       C    z  100

In [32]:
df.sort_values(by = 'amt', ascending=False)

  company mngr  amt
4       C    p  300
5       D    q  225
1       B    y  200
3       A    x  150
0       A    x  100
2       C    z  100

#### to find null values

In [33]:
df.isnull()

   company   mngr    amt
0    False  False  False
1    False  False  False
2    False  False  False
3    False  False  False
4    False  False  False
5    False  False  False

In [34]:
df.isnull().sum()

company    0
mngr       0
amt        0
dtype: int64

In [35]:
df.isna().sum()

company    0
mngr       0
amt        0
dtype: int64

#### pivot table

In [36]:
df

  company mngr  amt
0       A    x  100
1       B    y  200
2       C    z  100
3       A    x  150
4       C    p  300
5       D    q  225

In [38]:
df.pivot_table(values='amt', index=['company'], columns=['mngr'])

mngr         p      q      x      y      z
company
A          NaN    NaN  125.0    NaN    NaN
B          NaN    NaN    NaN  200.0    NaN
C        300.0    NaN    NaN    NaN  100.0
D          NaN  225.0    NaN    NaN    NaN

In [40]:
df.pivot_table(values='amt', index=['company'], aggfunc='count')

         amt
company
A          2
B          1
C          2
D          1

In [41]:
df.pivot_table(values='amt', index=['company'], aggfunc='sum')

         amt
company
A        250
B        200
C        400
D        225